package com.bookkeeping.myapplication;

import java.util.ArrayList;
import java.util.List;

/**
 * @author : qiuyiyang
 * @date : 2021/10/29  17:10
 * @desc :
 */
public class Test  {
    public static void main(String[] args) {
        List<String[]> mList=new ArrayList<>();
        String s="玩家名称,玩家编号,总突击伤害,泰坦编号,泰坦名称,泰坦伤害,头部(装甲),身体(装甲),左臂(装甲),右臂(装甲),左手(装甲),右手(装甲),左腿(装甲),右腿(装甲),头部(肉体),身体(肉体),左臂(肉体),右臂(肉体),左手(肉体),右手(肉体),左腿(肉体),右腿(肉体),头部(骨架),身体(骨架),左臂(骨架),右臂(骨架),左手(骨架),右手(骨架),左腿(骨架),右腿(骨架)\n" +
                "亜人,876b5qx,30,0,Terro,55372089,586874,25182037,4558911,3733608,0,3020801,0,3754436,0,6149636,1491146,1281660,1681577,732645,2474442,724310,0,0,0,0,0,0,0,0\n" +
                "亜人,876b5qx,30,1,Sterl,48082668,389547,0,1788857,6101763,0,0,0,0,0,14591608,2567820,3939892,4473035,4911816,4452660,4865666,0,0,0,0,0,0,0,0\n" +
                "亜人,876b5qx,30,2,Sterl,30065037,0,22379695,0,0,0,0,0,0,0,7685341,0,0,0,0,0,0,0,0,0,0,0,0,0,0\n" +
                "亜人,876b5qx,30,3,Terro,57775528,321739,30253248,0,0,0,0,5727820,0,0,7514532,1963414,2439829,2195416,3039792,2421914,1897819,0,0,0,0,0,0,0,0\n" +
                "亜人,876b5qx,30,4,Mohaca,30528507,1523130,62708,0,0,0,0,0,0,0,0,3330929,4059068,5987631,4493846,5335127,5736064,0,0,0,0,0,0,0,0\n" +
                "亜人,876b5qx,30,5,Sterl,30708045,0,0,0,0,0,0,22188170,0,0,8519875,0,0,0,0,0,0,0,0,0,0,0,0,0,0\n" +
                "亜人,876b5qx,30,6,Sterl,109619383,184719,4060783,3129175,2856201,1428146,3504861,3398649,24940670,0,32056543,5375524,6166186,7099684,4384694,5622340,5411200,0,0,0,0,0,0,0,0";


        String[] split=s.split("\\n");
        for (String s1:split){
            String[] strings=s1.split(",");
            mList.add(strings);
        }
        for (int i=0;i<mList.size();i++){
           for (String string :mList.get(i)){
               System.out.print(string);
           }
           System.out.print("\n");
        }
    }
}
